# What's Your Name?
# Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:

# «Hello [введенное имя] [введенная фамилия]! You just delved into Python».

# Формат входных данных
# На вход программе подаётся две строки (имя и фамилия), каждая на отдельной строке.

# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

# Примечание. Между firstname lastname вставьте пробел =)

# Тестовые данные 🟢
#     Номер теста    	    Входные данные    	    Выходные данные    
# 1	Anthony
# Joshua	Hello Anthony Joshua! You just delved into Python
# 2	Michael
# Jordan	Hello Michael Jordan! You just delved into Python
# 3	Leonardo
# DiCaprio	Hello Leonardo DiCaprio! You just delved into Python


f = input()
l = input()
print('Hello', f, l +'!', 'You just delved into Python')


# Другое решение


print('Hello',input(),input()+'!','You just delved into Python')