# Площадь треугольника
# Напишите программу, которая считывает длины двух катетов 
# в прямоугольном треугольнике и выводит его площадь.

a = float(input())
b = float(input())

print((a * b) / 2)
